app/views/ratings/index.html.erb

  <% @users.top(3).each do |user| %>
      <li> <%= user.username %>, <%= user.favorite_beer %>, <%= user.favorite_style %>, <%= user.favorite_brewery.name %>, <%= user.ratings.count %> </li>
---
SELECT "breweries".* FROM "breweries"
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]