app/views/breweries/index.json.jbuilder

SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 38]]
---
  json.beer do
    json.count brewery.beers.count