app/views/beers/_form.html.erb

      <%= f.label :style %><br>
      <%= f.select :style_id, options_from_collection_for_select(@styles, :id, :name, selected: @beer.style_id) %>
---
SELECT "styles".* FROM "styles"

      <%= f.label :brewery %><br>
      <%= f.select :brewery_id, options_from_collection_for_select(@breweries, :id, :name, selected: @beer.brewery_id) %>
---
SELECT "breweries".* FROM "breweries"