app/controllers/beers_controller.rb

  def index
    @beers = Beer.includes(:brewery, :style).all
---
SELECT "beers".* FROM "beers"
SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" IN (1, 2, 3, 4)
SELECT "styles".* FROM "styles" WHERE "styles"."id" IN (1, 2, 3)

  def create
    ["beerlist-name", "beerlist-brewery", "beerlist-style"].each{ |f| expire_fragment(f) }
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 4], ["created_at", Mon, 17 Feb 2014 10:54:34 UTC +00:00], ["name", "Le Kukko"], ["style_id", 2], ["updated_at", Mon, 17 Feb 2014 10:54:34 UTC +00:00]]

  def update
    ["beerlist-name", "beerlist-brewery", "beerlist-style"].each{ |f| expire_fragment(f) }
    respond_to do |format|
      if @beer.update(beer_params)
---
UPDATE "beers" SET "style_id" = ?, "updated_at" = ? WHERE "beers"."id" = 1  [["style_id", 1], ["updated_at", Mon, 17 Feb 2014 10:54:05 UTC +00:00]]

  def destroy
    ["beerlist-name", "beerlist-brewery", "beerlist-style"].each{ |f| expire_fragment(f) }
    @beer.destroy
---
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 11]]

  def set_breweries_and_styles_for_template
    @breweries = Brewery.all
    @styles = Style.all
---
SELECT "breweries".* FROM "breweries"
SELECT "styles".* FROM "styles"