app/controllers/beers_controller.rb

  def set_breweries_and_styles_for_template
    @breweries = Brewery.all
    @styles = Style.all
---
SELECT "styles".* FROM "styles"