app/controllers/beer_clubs_controller.rb

  def index
    @beer_clubs = BeerClub.all
---
SELECT "beer_clubs".* FROM "beer_clubs"

  def create
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save
---
INSERT INTO "beer_clubs" ("city", "created_at", "founded", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "Helsinki"], ["created_at", Thu, 23 Jan 2014 00:02:58 UTC +00:00], ["founded", 1989], ["name", "Vallilan hiiva"], ["updated_at", Thu, 23 Jan 2014 00:02:58 UTC +00:00]]

    def set_beer_club
      @beer_club = BeerClub.find(params[:id])
---
SELECT "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT 1  [["id", "2"]]