app/controllers/breweries_controller.rb

  def create
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save
---
INSERT INTO "breweries" ("active", "created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?, ?)  [["active", true], ["created_at", Tue, 18 Feb 2014 08:07:48 UTC +00:00], ["name", "Kahlaamo"], ["updated_at", Tue, 18 Feb 2014 08:07:48 UTC +00:00], ["year", 2012]]

  def update
    respond_to do |format|
      if @brewery.update(brewery_params)
---
UPDATE "breweries" SET "name" = ?, "updated_at" = ? WHERE "breweries"."id" = 4  [["name", "BrewDog"], ["updated_at", Thu, 16 Jan 2014 19:41:59 UTC +00:00]]