app/controllers/memberships_controller.rb

SELECT "beer_clubs".* FROM "beer_clubs"
---
  def new
    @membership = Membership.new
    @clubs = BeerClub.all.reject{ |b| b.members.include? current_user }

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "memberships" ("beer_club_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["created_at", Thu, 23 Jan 2014 00:18:20 UTC +00:00], ["updated_at", Thu, 23 Jan 2014 00:18:20 UTC +00:00], ["user_id", 3]]
SELECT "beer_clubs".* FROM "beer_clubs"
---
  def create
    @membership = Membership.new(membership_params)
    @membership.user = current_user
    @beer_club = @membership.beer_club
    @user = User.find(session[:user_id])

    if @membership.save
      redirect_to beer_club_path @beer_club, notice: "#{@user.username}, welcome to the club"
    else
      @clubs = BeerClub.all.reject{ |b| b.members.include? current_user }

SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_membership
      @membership = Membership.find(params[:id])